app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "sdfsad"], ["text", "sdafsadf"], ["created_at", "2019-11-18 13:52:34.431504"], ["updated_at", "2019-11-18 13:52:34.431504"]]
---
    def create
      @article = Article.new(article_params)

      if @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "articles" SET "title" = $1, "text" = $2, "updated_at" = $3 WHERE "articles"."id" = $4  [["title", "motdsad"], ["text", "sdassad"], ["updated_at", "2019-11-18 13:21:13.344722"], ["id", 17]]
---
    def update
      @article = Article.find(params[:id])

      if @article.update(article_params)